scripts/bench/.run/native.ab.raw.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:
Server Hostname: 127.0.0.1
Server Port: 18090

Document Path: /v1/chat/completions
Document Length: 387 bytes

Concurrency Level: 10
Time taken for tests: 0.296 seconds
Complete requests: 1000
Failed requests: 0
Total transferred: 495000 bytes
Total body sent: 237000
HTML transferred: 387000 bytes
Requests per second: 3375.90 [#/sec] (mean)
Time per request: 2.962 [ms] (mean)
Time per request: 0.296 [ms] (mean, across all concurrent requests)
Transfer rate: 1631.91 [Kbytes/sec] received
 781.34 kb/s sent
 2413.24 kb/s total

Connection Times (ms)
 min mean[+/-sd] median max
Connect: 0 0 0.0 0 1
Processing: 1 3 3.7 2 36
Waiting: 1 3 3.7 2 36
Total: 1 3 3.7 2 36

Percentage of the requests served within a certain time (ms)
 50% 2
 66% 3
 75% 3
 80% 3
 90% 3
 95% 3
 98% 13
 99% 34
 100% 36 (longest request)